[
    {
        "name": "Matchless Silver Hawk",
        "image": "MatchlessSilverHawk.png",
        "description": "The Matchless Silver Hawk was an advanced motorcycle introduced in 1931, featuring a 593cc V-four engine. It was considered a luxury model, combining innovative engineering with smooth performance. With its enclosed valve gear and four-cylinder design, the Silver Hawk was one of the most unique motorcycles of its time. However, due to its high cost and the onset of the Great Depression, production was limited.",
        "year": "1931-1935",
        "engine": "593cc V-four",
        "topSpeed": "85 mph",
        "weight": "390 lbs",
        "gearbox": "4-speed Burman",
        "wd": false
    },
    {
        "name": "Matchless Model X",
        "image": "MatchlessModelX.png",
        "description": "The Matchless Model X was a powerful V-twin motorcycle produced from the late 1930s. Known for its large 990cc engine, it was primarily used as a civilian and sidecar bike before World War II. Its strong performance, coupled with excellent handling for its size, made it popular for long-distance riding and sidecar work.",
        "year": "1937-1939",
        "engine": "990cc V-twin",
        "topSpeed": "80 mph",
        "weight": "450 lbs",
        "gearbox": "4-speed Burman",
        "wd": false
    },
    {
        "name": "Matchless G3WO",
        "image": "MatchlessG3WO.png",
        "description": "The Matchless G3WO was produced for military use during World War II and was known for its ruggedness and reliability in harsh conditions. It was an early version of the G3 series, featuring a 350cc engine and rigid rear suspension.",
        "year": "1939-1941",
        "engine": "350cc single-cylinder",
        "topSpeed": "70 mph",
        "weight": "395 lbs",
        "gearbox": "4-speed Burman",
        "wd": true
    },
    {
        "name": "Matchless WD G3L",
        "image": "MatchlessWDG3L.png",
        "description": "The WD G3L was the first military motorcycle to feature Teledraulic front forks, offering better handling and comfort for off-road use. It was widely used by the British Army during World War II and earned a reputation for being robust and easy to maintain.",
        "year": "1941-1945",
        "engine": "350cc single-cylinder",
        "topSpeed": "70 mph",
        "weight": "350 lbs",
        "gearbox": "4-speed Burman",
        "wd": true
    },
    {
        "name": "Matchless G3L",
        "image": "MatchlessG3L.png",
        "description": "The civilian version of the G3L was introduced in 1945, carrying forward the innovative Teledraulic forks from the military model. It became a popular bike post-war, offering reliable performance and smooth handling.",
        "year": "1945-1954",
        "engine": "350cc single-cylinder",
        "topSpeed": "70 mph",
        "weight": "350 lbs",
        "gearbox": "4-speed Burman",
        "wd": false
    },
    {
        "name": "Matchless G80",
        "image": "MatchlessG80-1948.png",
        "description": "The Matchless G80, introduced in the late 1940s, was a larger 500cc single-cylinder version designed for more powerful performance. It featured Teledraulic front forks and became known for its robustness and versatility on both road and off-road terrains.",
        "year": "1945-1957",
        "engine": "500cc single-cylinder",
        "topSpeed": "85 mph",
        "weight": "390 lbs",
        "gearbox": "4-speed Burman",
        "wd": false
    },
    {
        "name": "Matchless G3LS",
        "image": "MatchlessG3LS.png",
        "description": "The G3LS was a popular civilian motorcycle introduced in the 1950s, with the 'S' denoting its rear spring suspension. This model provided improved comfort and ride quality, making it a favorite for long-distance riding.",
        "year": "1949-1956",
        "engine": "350cc single-cylinder",
        "topSpeed": "70 mph",
        "weight": "370 lbs",
        "gearbox": "4-speed Burman",
        "wd": false
    },
    {
        "name": "Matchless G80",
        "image": "MatchlessG80-1955.png",
        "description": "The Matchless G80 from the mid-1950s was an updated version of the earlier 500cc model, featuring improvements in suspension and overall design. It was widely appreciated for its power and durability on a variety of terrains.",
        "year": "1955-1966",
        "engine": "500cc single-cylinder",
        "topSpeed": "85 mph",
        "weight": "400 lbs",
        "gearbox": "4-speed Burman",
        "wd": false
    },
    {
        "name": "Matchless G11",
        "image": "MatchlessG11-1958.png",
        "description": "The Matchless G11, introduced in 1956, featured a 600cc twin-cylinder engine, offering more power than previous models. It was built for touring and long-distance rides with a focus on comfort and durability.",
        "year": "1956-1958",
        "engine": "593cc twin-cylinder",
        "topSpeed": "90 mph",
        "weight": "395 lbs",
        "gearbox": "4-speed AMC gearbox",
        "wd": false
    },
    {
        "name": "Matchless G12",
        "image": "MatchlessG12-1961.png",
        "description": "The Matchless G12 was produced in the late 1950s and early 1960s, featuring a powerful 650cc twin-cylinder engine. It was designed for high-speed touring and was known for its smooth handling and reliability on long journeys.",
        "year": "1958-1966",
        "engine": "646cc twin-cylinder",
        "topSpeed": "95 mph",
        "weight": "410 lbs",
        "gearbox": "4-speed AMC gearbox",
        "wd": false
    },
    {
        "name": "Matchless G50",
        "image": "MatchlessG50.png",
        "description": "The Matchless G50 was a racing motorcycle introduced in 1958. It was based on the successful Matchless G45 but featured a more powerful 500cc engine, making it highly competitive in racing circuits. Known for its lightweight frame and reliability, the G50 became a popular choice among private racers and was used extensively in Grand Prix motorcycle racing.",
        "year": "1958-1963",
        "engine": "500cc single-cylinder",
        "topSpeed": "135 mph",
        "weight": "320 lbs",
        "gearbox": "4-speed AMC gearbox",
        "wd": false
    }
]