[

    {
        "id": 3,
        "title": "Valve Timing for AJS and Matchless Heavyweight Singles",
        "image": "timing.png",
        "content": "<p></p><p>Valve timing is a critical part of engine maintenance and performance optimization for AJS and Matchless heavyweight single-cylinder motorcycles. The cam timing process can seem complex due to the timing dot and numbering system used on the cams, but it is straightforward when broken down step by step.</p><p><strong>Step 1: Verify Timing Side Shaft Alignment</strong></p><p>To begin, confirm that the small pinion and the timing side shaft are properly aligned with the flywheel. This can be checked by positioning the piston at Top Dead Centre (TDC) and ensuring the timing dot on the small pinion is also positioned at the top. If these elements are not aligned, and the timing key is intact, the crankshaft may need to be realigned.</p><p><strong>Step 2: Timing Cams with One or Two Dots</strong></p><p>For cams with one or two timing dots, follow these steps:</p><ol><li>Rotate the crankshaft so that the dot on the small pinion aligns with the inlet cam bush.</li><li>Position the inlet cam so its top points at approximately 2 o’clock, using the dot nearest to the pinion dot for alignment.</li><li>Turn the crankshaft clockwise until the dot on the small pinion aligns with the exhaust cam bush.</li><li>Position the exhaust cam so its top points at approximately 10 o’clock, again using the dot nearest the pinion dot for alignment.</li></ol><p><strong>Step 3: Timing Cams with Three Dots</strong></p><p>For cams with three dots, the process is similar, but with specific instructions depending on engine size:</p><ol><li>Rotate the crankshaft so that the pinion dot aligns with the inlet cam bush.</li><li>For a 350cc engine, use the lowest dot on the cam; for a 500cc engine, use the uppermost dot.</li><li>Turn the crankshaft clockwise until the pinion dot aligns with the exhaust cam bush.</li><li>Position the exhaust cam with the top at approximately 10 o’clock and use the nearest dot for alignment.</li></ol><p><strong>Final Check</strong></p><p>Ensure that the cams are securely seated and that no components have shifted during the installation process. If all alignments are correct, the cam timing should now be set correctly.</p><p><strong>Considerations for Cam Replacement</strong></p><ul><li><strong>High Lift Cams:</strong> When installing higher lift cams, ensure that there is no interference between components such as the tappet foot and the tappet guide.</li><li><strong>Year Irrelevance:</strong> The timing procedure works consistently across different years, provided the correct lift and clearance specifications are used.</li></ul><p><strong>Performance Adjustments for 500cc Singles</strong></p><p>To improve performance on a 500cc engine with three-dot cams, some enthusiasts follow the timing procedure for the 350cc engine. This modification, combined with lightweight engine rockers, can provide noticeable performance gains. Care should be taken to ensure that the pushrods do not come into contact with the tops of the pushrod tubes, as some tubes may have manufacturing imperfections.</p><p><strong>Factory Cam Options</strong></p><p>Several factory camshaft options are available, each with specific profiles suited to different types of performance. These include:</p><ul><li><strong>SH Scrambles Cams:</strong> Cams designed for scrambles racing.</li><li><strong>R Cams:</strong> Similar to SH cams but with an earlier designation.</li><li><strong>Cl Cams:</strong> Often used in the G80R models, known for their peaky power delivery.</li><li><strong>CE Cams:</strong> Exhaust cams found in certain scrambler models like the G80R.</li></ul>"
      }
  ]